import 'package:mis_lab1/models/exam_model.dart';

final List<Exam> examList = [
  Exam(
    name: 'Веб програмирање',
    dateTime: DateTime(2025, 11, 15, 10, 0),
    rooms: ['ЛАБ 215', 'ЛАБ 138', 'ЛАБ 200АБ', 'ЛАБ 200В'],
  ),
  Exam(
    name: 'Континуирана интеграција и испорака',
    dateTime: DateTime(2025, 6, 10, 14, 30),
    rooms: ['ЛАБ 117', 'ЛАБ 215'],
  ),
  Exam(
    name: 'Електронска и мобилна трговија',
    dateTime: DateTime(2025, 6, 20, 10, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138', 'ЛАБ 200АБ', 'ЛАБ 200В'],
  ),
  Exam(
    name: 'Бази на податоци',
    dateTime: DateTime(2025, 11, 17, 10, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138', 'ЛАБ 200АБ', 'ЛАБ 200В'],
  ),
  Exam(
    name: 'Мобилни информациски системи',
    dateTime: DateTime(2025, 12, 15, 10, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138', 'ЛАБ 200АБ', 'ЛАБ 200В'],
  ),
  Exam(
    name: 'Имплементација на системи со слободен и отворен код',
    dateTime: DateTime(2025, 11, 20, 10, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138', 'ЛАБ 200АБ', 'ЛАБ 200В'],
  ),
  Exam(
    name: 'Маркетинг',
    dateTime: DateTime(2026, 1, 20, 16, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138'],
  ),
  Exam(
    name: 'Примена на алгоритми и податочни структури',
    dateTime: DateTime(2026, 1, 25, 10, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138', 'ЛАБ 200АБ', 'ЛАБ 200В'],
  ),
  Exam(
    name: 'Компјутерски мрежи и безбедност',
    dateTime: DateTime(2026, 1, 23, 10, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138', 'ЛАБ 200АБ'],
  ),
  Exam(
    name: 'Напредно програмирање',
    dateTime: DateTime(2026, 2, 2, 10, 00),
    rooms: ['ЛАБ 215', 'ЛАБ 138','ЛАБ 200В'],
  ),
];